<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"dev","backend":"7ab6bb46ac647259bab8d94841172aefd09db94552ace3c048c7663e0d53d5b3","plan_job_ref":"Job Pull Request Checks #2969 at https://github.com/GSA-TTS/FAC/actions/runs/9035347773","plan_out_hash":"9358cfbba2da9c4a46d2636c37ddb5a113e280cf355a467d487c82944a560d26","plan_hash":"e8d1bb03770f103fdab54d3e4fed9baca6c8e1deb2542daf75ff7345f38aeeca","plan_text_format":"diff","version":"1.42.0"} -->
Terraform plan for __dev__
<details>
<summary>Plan: 8 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # module.dev.cloudfoundry_network_policy.scanner-network-policy will be created
+   resource "cloudfoundry_network_policy" "scanner-network-policy" {
+       id = (known after apply)

+       policy {
+           destination_app = "a6eb3870-2769-4aa9-a8f2-f1a31939f563"
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

  # module.dev.module.fac-file-scanner.cloudfoundry_app.scanner_app will be created
+   resource "cloudfoundry_app" "scanner_app" {
+       buildpack                       = "https://github.com/cloudfoundry/python-buildpack"
+       disk_quota                      = 512
+       enable_ssh                      = (known after apply)
+       environment                     = (sensitive value)
+       health_check_http_endpoint      = (known after apply)
+       health_check_invocation_timeout = (known after apply)
+       health_check_timeout            = (known after apply)
+       health_check_type               = "port"
+       id                              = (known after apply)
+       id_bg                           = (known after apply)
+       instances                       = 1
+       memory                          = 512
+       name                            = "fac-file-scanner"
+       path                            = "../shared/modules/scanner/scanner.zip"
+       ports                           = (known after apply)
+       space                           = "06525ba3-19c2-451b-96e9-ea4a9134e8b9"
+       stack                           = (known after apply)
+       stopped                         = false
+       strategy                        = "rolling"
+       timeout                         = 180

+       routes {
+           port  = (known after apply)
+           route = (known after apply)
        }

+       service_binding {
+           service_instance = (known after apply)
        }
+       service_binding {
+           service_instance = "d791aab9-8e4d-4fe2-8d0c-4977aea66719"
        }
+       service_binding {
+           service_instance = (known after apply)
        }
+       service_binding {
+           service_instance = "666ac5f3-e733-4701-8037-58354e3d677a"
        }
    }

  # module.dev.module.fac-file-scanner.cloudfoundry_route.scanner_route will be created
+   resource "cloudfoundry_route" "scanner_route" {
+       domain   = "26df58ef-0c0d-4997-b68b-8defb7b3998b"
+       endpoint = (known after apply)
+       hostname = "fac-file-scanner-dev"
+       id       = (known after apply)
+       port     = (known after apply)
+       space    = "06525ba3-19c2-451b-96e9-ea4a9134e8b9"
    }

  # module.dev.module.fac-file-scanner.cloudfoundry_user_provided_service.clam will be created
+   resource "cloudfoundry_user_provided_service" "clam" {
+       credentials = (sensitive value)
+       id          = (known after apply)
+       name        = "clamav_ups"
+       space       = "06525ba3-19c2-451b-96e9-ea4a9134e8b9"
    }

  # module.dev.module.file_scanner_clamav.data.cloudfoundry_app.app will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_app" "app" {
+       buildpack                  = (known after apply)
+       command                    = (known after apply)
+       disk_quota                 = (known after apply)
+       enable_ssh                 = (known after apply)
+       environment                = (sensitive value)
+       health_check_http_endpoint = (known after apply)
+       health_check_timeout       = (known after apply)
+       health_check_type          = (known after apply)
+       id                         = (known after apply)
+       instances                  = (known after apply)
+       memory                     = (known after apply)
+       name                       = (known after apply)
+       name_or_id                 = "****************"
+       space                      = (known after apply)
+       stack                      = (known after apply)
+       state                      = (known after apply)
    }

  # module.dev.module.file_scanner_clamav.data.cloudfoundry_domain.internal will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_domain" "internal" {
+       domain   = (known after apply)
+       id       = (known after apply)
+       internal = (known after apply)
+       name     = "apps.internal"
+       org      = (known after apply)
    }

  # module.dev.module.file_scanner_clamav.data.cloudfoundry_space.space will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_space" "space" {
+       id       = (known after apply)
+       name     = "dev"
+       org      = (known after apply)
+       org_name = "gsa-tts-oros-fac"
+       quota    = (known after apply)
    }

  # module.dev.module.file_scanner_clamav.cloudfoundry_app.clamav_api will be created
+   resource "cloudfoundry_app" "clamav_api" {
+       buildpack                       = (known after apply)
+       disk_quota                      = 2048
+       docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:a6b645538b565528a5dba563be597d5d7c8fe162a4924b14048d50d117450cf8"
+       enable_ssh                      = (known after apply)
+       environment                     = (sensitive value)
+       health_check_http_endpoint      = (known after apply)
+       health_check_invocation_timeout = (known after apply)
+       health_check_timeout            = (known after apply)
+       health_check_type               = "port"
+       id                              = (known after apply)
+       id_bg                           = (known after apply)
+       instances                       = 1
+       memory                          = 3072
+       name                            = "fac-av-dev-fs"
+       ports                           = (known after apply)
+       space                           = (known after apply)
+       stack                           = (known after apply)
+       stopped                         = false
+       strategy                        = "rolling"
+       timeout                         = 600

+       routes {
+           port  = (known after apply)
+           route = (known after apply)
        }
    }

  # module.dev.module.file_scanner_clamav.cloudfoundry_network_policy.clamav_routing will be created
+   resource "cloudfoundry_network_policy" "clamav_routing" {
+       id = (known after apply)

+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

  # module.dev.module.file_scanner_clamav.cloudfoundry_route.clamav_route will be created
+   resource "cloudfoundry_route" "clamav_route" {
+       domain   = (known after apply)
+       endpoint = (known after apply)
+       hostname = "fac-av-dev-fs"
+       id       = (known after apply)
+       port     = (known after apply)
+       space    = (known after apply)
    }

  # module.dev.module.fac-file-scanner.module.quarantine.cloudfoundry_service_instance.bucket will be created
+   resource "cloudfoundry_service_instance" "bucket" {
+       id                             = (known after apply)
+       name                           = "fac-file-scanner-quarantine"
+       replace_on_params_change       = false
+       replace_on_service_plan_change = false
+       service_plan                   = "021bb2a3-7e11-4fc2-b06b-d9f5938cd806"
+       space                          = "06525ba3-19c2-451b-96e9-ea4a9134e8b9"
+       tags                           = [
+           "s3",
        ]
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.dev.module.cg-logshipper.module.s3-logshipper-storage.cloudfoundry_service_instance.bucket,
  on /tmp/terraform-data-dir/modules/dev.cg-logshipper.s3-logshipper-storage/s3/main.tf line 14, in resource "cloudfoundry_service_instance" "bucket":
  14:   recursive_delete = var.recursive_delete

Since CF API v3, recursive delete is always done on the cloudcontroller side.
This will be removed in future releases

(and 4 more similar warnings elsewhere)
```
</details>

:memo: Plan generated in [Pull Request Checks #2969](https://github.com/GSA-TTS/FAC/actions/runs/9035347773)